In [3]:
import pandas as pd
data=pd.read_csv("student_scores.csv")
data.head(10)

     name  hours  score gender grades class
0   Aarav      8     76      M      A    9A
1    Riya      5     62      F      B    9B
2   Kabir     10     88      M      A   10A
3    Sana      4     55      F      C    9A
4  Vivaan      7     72      M      B   10B
5  Ishita      6     64      F      B    9C
6   Rohan      3     48      M      D    9B
7   Meera      9     90      F      A   11A
8  Aditya      2     38      M      F    9C
9   Kavya     11     93      F      A   12A

In [6]:
print('columns:', data.columns.tolist())
print('\nInfo:')
print(data.info())
print('\nDescribe:')
display(data.describe())

columns: ['name', 'hours', 'score', 'gender', 'grades', 'class']

Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 92 entries, 0 to 91
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    92 non-null     object
 1   hours   92 non-null     int64
 2   score   92 non-null     int64
 3   gender  92 non-null     object
 4   grades  92 non-null     object
 5   class   92 non-null     object
dtypes: int64(2), object(4)
memory usage: 4.4+ KB
None

Describe:

           hours      score
count  92.000000  92.000000
mean    6.510870  68.836957
std     2.265336  15.692286
min     2.000000  35.000000
25%     5.000000  57.000000
50%     7.000000  70.000000
75%     8.000000  82.000000
max    11.000000  94.000000

In [9]:
print(data.isnull().sum())
data["score"]= data["score"].fillna(data["score"].mean())
data =data.dropna()

name      0
hours     0
score     0
gender    0
grades    0
class     0
dtype: int64

In [11]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
data["gender"] =le.fit_transform(data["gender"])
print(data.head(20))

       name  hours  score  gender grades class
0     Aarav      8     76       1      A    9A
1      Riya      5     62       0      B    9B
2     Kabir     10     88       1      A   10A
3      Sana      4     55       0      C    9A
4    Vivaan      7     72       1      B   10B
5    Ishita      6     64       0      B    9C
6     Rohan      3     48       1      D    9B
7     Meera      9     90       0      A   11A
8    Aditya      2     38       1      F    9C
9     Kavya     11     93       0      A   12A
10    Naman      5     60       1      B   10A
11   Jhanvi      7     70       0      B   11B
12   Pranav      4     52       1      C    9A
13     Tara      9     85       0      A   12B
14     Yash      6     66       1      B   10C
15    Anaya      8     78       0      A   11A
16    Harsh      3     45       1      D    9A
17     Diya     10     89       0      A   12C
18  Sarthak      6     63       1      B   10B
19    Manya      7     74       0      B   11B

In [16]:
le= LabelEncoder()
data["class_encoded"]=le.fit_transform(data["grades"])
x=data[["hours","class_encoded"]]
y=data["score"]

In [28]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_test,y_train = train_test_split(x,y,test_size=0.2, random_state=42)
x_train

    hours  class_encoded
65      8              0
15      8              0
68      7              1
78      6              1
30      5              2
..    ...            ...
20      8              0
60      4              2
71      6              1
14      6              1
51     10              0

[73 rows x 2 columns]

In [30]:
from sklearn.preprocessing import StandardScaler
scaler=StandardScaler()
x_train=scaler.fit_transform(x_train)
x_test =scaler.transform(x_test)

In [34]:
x_train_scaled=scaler.fit_transform(x_train)
x_test_scaled =scaler.transform(x_test)
x_train,x_test,y_test,y_train = train_test_split(x,y,test_size=0.2, random_state=42)
print("x train shape:",x_train.shape)
print("x test shape:",x_test.shape)
print("y train shape:",y_train.shape)
print("y test shape:",y_test.shape)
print("mean",x_train_scaled.mean(axis=0))
print("std:",x_train_scaled.std(axis=0))

x train shape: (73, 2)
x test shape: (19, 2)
y train shape: (19,)
y test shape: (73,)
mean [-7.90843798e-17  5.77924314e-17]
std: [1. 1.]